In [ ]:
## 데이터 프레임 처리

In [ ]:
###데이터프레임

#### 데이터프레임 생성 1: 파일에서
> - 데이터 프레임은 R에서 가장 널리 사용되는 구조이다.
> - 데이터 셋을 조작하고 저장하는 표준 자료구조이다.

In [1]:
read.csv('test.csv')

  item     price sales
1 풍선       100 200
2 펌프      3000   5
3 테이프     300  20
4 플랜카드 20000   1
5 색종이     150 100

In [2]:
#### 데이터 프레임 생성 2: data.frame()

x <- c(1,2,3,4,5)
y <- c(10,20,30,40,50)
z <- c("M","M",'M','F','F')

d <- data.frame(x,y,z)
d

  x y  z
1 1 10 M
2 2 20 M
3 3 30 M
4 4 40 F
5 5 50 F

In [4]:
# 아래와 같은 형태로 만들 수도 있다. 
d <- data.frame(x = c(1,2,3),y = c(10,20,30))
d

  x y
1 1 10
2 2 20
3 3 30

In [6]:
id <- c(1,2,3,4,5)
factory <- c("평택지부1","평택지부2","안산지부","인천지부","원주서부")
sales <- c(70,90,80,85,87)

d <- data.frame(id, factory, sales) 
# 이름과 같이 factor저장되는 것이 불필요한 자료들이 있을 수 있다. 그럴 경우에는 data.frame인자에서 stringAsfactors를 FALSE로 지정 
d
str(d)

  id factory   sales
1 1  평택지부1 70
2 2  평택지부2 90
3 3  안산지부  80
4 4  인천지부  85
5 5  원주서부  87

'data.frame':	5 obs. of  3 variables:
 $ id     : num  1 2 3 4 5
 $ factory: Factor w/ 5 levels "안산지부","원주서부",..: 4 5 1 3 2
 $ sales  : num  70 90 80 85 87

In [ ]:
#### 특정컬럼 데이터 유형 변환

In [8]:
id <- c(1,2,3,4,5)
factory <- c("평택지부1","평택지부2","안산지부","인천지부","원주서부")
type <- c("공장","공장","오피스","오피스","오피스")
sales <- c(70,90,80,85,87)

d <- data.frame(id,factory,type,sales ,stringsAsFactors = FALSE)
str(d)

d$type <- as.factor(d$type)
str(d)

'data.frame':	5 obs. of  4 variables:
 $ id     : num  1 2 3 4 5
 $ factory: chr  "평택지부1" "평택지부2" "안산지부" "인천지부" ...
 $ type   : chr  "공장" "공장" "오피스" "오피스" ...
 $ sales  : num  70 90 80 85 87
'data.frame':	5 obs. of  4 variables:
 $ id     : num  1 2 3 4 5
 $ factory: chr  "평택지부1" "평택지부2" "안산지부" "인천지부" ...
 $ type   : Factor w/ 2 levels "공장","오피스": 1 1 2 2 2
 $ sales  : num  70 90 80 85 87

In [ ]:
#### 데이터 프레임 다루기: 특정 컬럼 선택

In [11]:
id <- 1:7
name <- c("김원경","박찬웅","조해선","김선영","이화영","양영욱","최필선")
gender <- c("F","M","F","F","F","M","M")
sales <- c(1000,2000,1500,2200,1700,2000,2200)

d <- data.frame(id,name,gender,sales,stringsAsFactors = F)
## 컬럼을 선택하는 다양한 방법 
d.col <- d$name
d.col
d.col <- d[,2]
d.col
d.col <- d[,"name"]
d.col

[1] "김원경" "박찬웅" "조해선" "김선영" "이화영" "양영욱" "최필선"

[1] "김원경" "박찬웅" "조해선" "김선영" "이화영" "양영욱" "최필선"

[1] "김원경" "박찬웅" "조해선" "김선영" "이화영" "양영욱" "최필선"

###### dplyr을 이용해서도 특정 컬럼을 불러올 수 있다. 이때 ctrl,shift,M 키를 함께 눌러주면 d 뒤에 있는 명령어를 입력할 수 있다.

In [13]:
d  %>%  select(name)

  name
1 김원경
2 박찬웅
3 조해선
4 김선영
5 이화영
6 양영욱
7 최필선

In [ ]:
#### 데이터 프레임 다루기: 다중 컬럼 선택

In [16]:
d.cols <- d[,c(2,3,4)]
d.cols
d.cols <- d[,2:4]
d.cols
d.cols <- d[,c("name",'gender',"sales")]
d.cols

  name   gender sales
1 김원경 F      1000
2 박찬웅 M      2000
3 조해선 F      1500
4 김선영 F      2200
5 이화영 F      1700
6 양영욱 M      2000
7 최필선 M      2200

  name   gender sales
1 김원경 F      1000
2 박찬웅 M      2000
3 조해선 F      1500
4 김선영 F      2200
5 이화영 F      1700
6 양영욱 M      2000
7 최필선 M      2200

  name   gender sales
1 김원경 F      1000
2 박찬웅 M      2000
3 조해선 F      1500
4 김선영 F      2200
5 이화영 F      1700
6 양영욱 M      2000
7 최필선 M      2200

In [ ]:
#### 데이터 프레임 다루기: 행 및 원소 선택

In [18]:
d.row <- d[2,] #특정 행 선택 
d.row
d.element <- d[2,3] # 특정 행,열(원소) 선택
d.element

  id name   gender sales
2 2  박찬웅 M      2000

[1] "M"

In [ ]:
#### 데이터프레임 다루기: 조건에 맞는 행 선택1

In [20]:
d.man <- d[d$gender == "M",] # gender행의 컬럼 내용이 M인 행만 가져온다. 
d.man
d.woman <- d[d$gender == "F",] # gender 컬럼 내용이 'F'인 행만 가져온다. 
d.woman

  id name   gender sales
2 2  박찬웅 M      2000
6 6  양영욱 M      2000
7 7  최필선 M      2200

  id name   gender sales
1 1  김원경 F      1000
3 3  조해선 F      1500
4 4  김선영 F      2200
5 5  이화영 F      1700

In [25]:
d[(d$sales>2000),] # 매출이 2000이상인 행만 추출
d[(d$gender == 'F')& (d$sales>2000),] # 매출이 2000이상, 성별이 여성인 행만 추출
d[(d$gender == 'F')|(d$sales>2000),] # 매출이 2000이상이거나 성별이 여성인 행만 추출

  id name   gender sales
4 4  김선영 F      2200
7 7  최필선 M      2200

  id name   gender sales
4 4  김선영 F      2200

  id name   gender sales
1 1  김원경 F      1000
3 3  조해선 F      1500
4 4  김선영 F      2200
5 5  이화영 F      1700
7 7  최필선 M      2200

In [26]:
d.man <- subset(d,gender == "M")
d.man

d.woman <- subset(d,gender = 'F') # gender 컬럼 내용이 'F인'행만
d.woman

subset(d,gender == "F",select = c(name,gender)) # 특정 컬럼 선택

  id name   gender sales
2 2  박찬웅 M      2000
6 6  양영욱 M      2000
7 7  최필선 M      2200

  id name   gender sales
1 1  김원경 F      1000
2 2  박찬웅 M      2000
3 3  조해선 F      1500
4 4  김선영 F      2200
5 5  이화영 F      1700
6 6  양영욱 M      2000
7 7  최필선 M      2200

  name   gender
1 김원경 F
3 조해선 F
4 김선영 F
5 이화영 F

In [27]:
subset(d,sales>2000)
subset(d,gender =="F" & sales>2000)
subset(d,gender == "F"|sales>2000)

subset(d,gender == "F"|sales>2000, select = c(name,gender))

  id name   gender sales
4 4  김선영 F      2200
7 7  최필선 M      2200

  id name   gender sales
4 4  김선영 F      2200

  id name   gender sales
1 1  김원경 F      1000
3 3  조해선 F      1500
4 4  김선영 F      2200
5 5  이화영 F      1700
7 7  최필선 M      2200

  name   gender
1 김원경 F
3 조해선 F
4 김선영 F
5 이화영 F
7 최필선 M

In [ ]:
#### 데이터 프레임 다루기: 조건에 맞는 행 선택

In [28]:
library(dplyr)
d.man <- d %>%  filter(gender =="M") # gender 컬럼 내용이 "M"인 행(index)만
d.man

  id name   gender sales
1 2  박찬웅 M      2000
2 6  양영욱 M      2000
3 7  최필선 M      2200

In [30]:
d.woman <- d %>% filter(gender == "F")# gender 컬럼 내용이 "F"인 행(index)만 
d.woman

  id name   gender sales
1 1  김원경 F      1000
2 3  조해선 F      1500
3 4  김선영 F      2200
4 5  이화영 F      1700

In [31]:
d  %>%  filter(sales > 2000)
d  %>%  filter(gender == "F"&sales > 2000)
d  %>%  filter(gender == "F"|sales > 2000)

  id name   gender sales
1 4  김선영 F      2200
2 7  최필선 M      2200

  id name   gender sales
1 4  김선영 F      2200

  id name   gender sales
1 1  김원경 F      1000
2 3  조해선 F      1500
3 4  김선영 F      2200
4 5  이화영 F      1700
5 7  최필선 M      2200

In [ ]:
#### 연습1 
> - 다음의 test.csv파일에서 기본방법(1번)과 subset() 함수를 이용한 방법(3번)을 이용하여 
> 1) sales가 5를 넘는 행을 추출하시오 
> 2) price가 300이상이면서 sales가 5이상인 행을 추출하시오 
> 3) subset() 함수를 이용하여 2의 결과에서 item 컬럼만 추출하시오

In [34]:
test <- read.csv("test.csv")

In [42]:
#1)
test %>% 
    filter(sales > 5)
subset(test,sales > 5)

  item   price sales
1 풍선   100   200
2 테이프 300    20
3 색종이 150   100

  item   price sales
1 풍선   100   200
3 테이프 300    20
5 색종이 150   100

In [41]:
# 2) 
a <- test  %>% 
    filter(sales > 5 & price>=300)
a <- subset(test,sales > 5 & price>=300)

In [40]:
a[1]

  item
1 테이프

#### 데이터프레임 다루기: 특정 요소 제외
> - d[,-2]
> - d[-2,]
> - d[,c(-1,-2)]

#### 데이터 프레임 다루기: 살펴보기
> - head(d,3) # 앞에서 3개까지 보기(default값 = 6)
> - tail(d,3) # 앞에서 3개까지 보기(default값 = 6)
> - View(d) # 표 형태로 보기(대문자로 시작)

In [43]:
head(d)

  id name   gender sales
1 1  김원경 F      1000
2 2  박찬웅 M      2000
3 3  조해선 F      1500
4 4  김선영 F      2200
5 5  이화영 F      1700
6 6  양영욱 M      2000

In [47]:
x1 <- c(1,2,3)
x2 <- c(4,5,6)
x3 <- c(7,8,9)
d <- data.frame(x1,x2,x3)
d

x4 <- c(10,11,12)
d2 <- cbind(d,x4)
d2

x5 <- c("James","Mary","Tony")
d3 <- cbind(d2,x5)
d3

  x1 x2 x3
1 1  4  7
2 2  5  8
3 3  6  9

  x1 x2 x3 x4
1 1  4  7  10
2 2  5  8  11
3 3  6  9  12

'data.frame':	3 obs. of  5 variables:
 $ x1: num  1 2 3
 $ x2: num  4 5 6
 $ x3: num  7 8 9
 $ x4: num  10 11 12
 $ x5: Factor w/ 3 levels "James","Mary",..: 1 2 3

  x1 x2 x3 x4 x5
1 1  4  7  10 James
2 2  5  8  11 Mary
3 3  6  9  12 Tony

In [ ]:
#### 데이터 프레임 추후 연결하기 - 원 데이터프레임 변경

In [48]:
x1 <- c(1,2,3)
x2 <- c(4,5,6)
x3 <- c(7,8,9)
d <- data.frame(x1,x2,x3)
d

x4 <- c(10,11,12)
d$x4 <- x4
d


x5 <- c("James","Mary","Tony")
d$x5 <- x5
d

  x1 x2 x3
1 1  4  7
2 2  5  8
3 3  6  9

  x1 x2 x3 x4
1 1  4  7  10
2 2  5  8  11
3 3  6  9  12

  x1 x2 x3 x4 x5
1 1  4  7  10 James
2 2  5  8  11 Mary
3 3  6  9  12 Tony

In [ ]:
#### 데이터프레임 추후 연결하기 - 파생변수 만들기

In [49]:
x1 <- c(1,2,3)
x2 <- c(4,5,6)
x3 <- c(7,8,9)
d <- data.frame(x1,x2,x3)
d

d$sum <- d$x1 + d$x2 + d$x3
d

d$pass <- ifelse(d$sum > 15, "pass","fail")
d

  x1 x2 x3
1 1  4  7
2 2  5  8
3 3  6  9

  x1 x2 x3 sum
1 1  4  7  12
2 2  5  8  15
3 3  6  9  18

  x1 x2 x3 sum pass
1 1  4  7  12  fail
2 2  5  8  15  fail
3 3  6  9  18  pass

In [ ]:
#### 데이터 프레임 추후 연결하기 - 두 개의 데이터프레임을 같은 기준으로 묶을 떄

In [59]:
a <- data.frame(id = c(1,2,3,4,5),mid = c(30,40,50,60,70))
b <- data.frame(id = c(6,5,4,3,2,1),final = c(80,70,90,100,90,80))
a
b
left_join(a,b,"id") # inner_join NA값은 제거
right_join(a,b,"id")
full_join(a,b,"id") # outer_join NA값은 비워둔 채로 join

  id mid
1 1  30
2 2  40
3 3  50
4 4  60
5 5  70

  id final
1 6   80
2 5   70
3 4   90
4 3  100
5 2   90
6 1   80

  id mid final
1 1  30   80
2 2  40   90
3 3  50  100
4 4  60   90
5 5  70   70

  id mid final
1 6  NA   80
2 5  70   70
3 4  60   90
4 3  50  100
5 2  40   90
6 1  30   80

  id mid final
1 1  30   80
2 2  40   90
3 3  50  100
4 4  60   90
5 5  70   70
6 6  NA   80

In [60]:
old1 <- c(1,2,3)
old2 <- c(4,5,6)
old3 <- c(7,8,9)
d <- data.frame(old1,old2,old3)
d

library(dplyr)
d <-  rename(d,new1 = old1)
d

  old1 old2 old3
1 1    4    7
2 2    5    8
3 3    6    9

  new1 old2 old3
1 1    4    7
2 2    5    8
3 3    6    9

#### 연습2
> - 타이타닉 데이터 셋을 남성과 여성으로 나누어 구분하고, 각각에 대한 생존율을 구하시오
> - 남성이면서, 10대 미만, 10대, 20대의 생존율을 구하시오 
> - 여성이면서, 10대 미만, 10대, 20대의 생존율을 구하시오

In [61]:
train <- read.csv("train.csv")
library(dplyr)

In [63]:
head(train)

  PassengerId Survived Pclass
1 1           0        3
2 2           1        1
3 3           1        3
4 4           1        1
5 5           0        3
6 6           0        3
  Name                                                Sex    Age SibSp Parch
1 Braund, Mr. Owen Harris                             male   22  1     0
2 Cumings, Mrs. John Bradley (Florence Briggs Thayer) female 38  1     0
3 Heikkinen, Miss. Laina                              female 26  0     0
4 Futrelle, Mrs. Jacques Heath (Lily May Peel)        female 35  1     0
5 Allen, Mr. William Henry                            male   35  0     0
6 Moran, Mr. James                                    male   NA  0     0
  Ticket           Fare    Cabin Embarked
1 A/5 21171         7.2500       S
2 PC 17599         71.2833 C85   C
3 STON/O2. 3101282  7.9250       S
4 113803           53.1000 C123  S
5 373450            8.0500       S
6 330877            8.4583       Q

In [74]:
train  %>%  
    filter(Sex == "male" & Age <30) %>% 
    mutate(Age_group= ifelse(Age <10,"10대 미만",ifelse(Age <20,"10대","20대"))) %>% 
    group_by(Age_group) %>% 
    summarise(생존율 = mean(Survived))

  Age_group 생존율
1 10대      0.1228070
2 10대 미만 0.5937500
3 20대      0.1689189

In [75]:
train  %>%  
    filter(Sex == "female" & Age <30) %>% 
    mutate(Age_group= ifelse(Age <10,"10대 미만",ifelse(Age <20,"10대","20대"))) %>% 
    group_by(Age_group) %>% 
    summarise(생존율 = mean(Survived))

  Age_group 생존율
1 10대      0.7555556
2 10대 미만 0.6333333
3 20대      0.7222222